Repository: 84000/data-translation-memory
Catalog: toh186-v2.tmx
Source language: bo
Languages: en

source: མེ་ཏོག་དང་། དྲིའི་ཆར་ཆེན་པོ་རབ་ཏུ་ཕབ་བོ། །
en: upon which a great rain of flowers and perfume fell.

source: སེམས་ཅན་འབུམ་ཚང་བ་རྣམས་སྡུག་བསྔལ་ཐམས་ཅད་ལས་གྲོལ་བར་གྱུར་ཏེ
en: One hundred thousand beings were all liberated from suffering and

source: ཕྱིར་མི་ལྡོག་པའི་ས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཀོད་དོ། །
en: established in unsurpassable, complete, and perfect awakening—the spiritual level from which there can be no relapse.

source: གཞན་ཡང་སེམས་ཅན་བྱེ་བ་རྣམས་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་སྐྱབས་སུ་འགྲོ་བ་ཡིད་ལ་བྱས་ཤིང་སེམས་དང་པོ་བསྐྱེད་པར་གྱུར་ཏོ། །
en: Moreover, ten million beings focused upon taking refuge in the Buddha, Dharma, and Saṅgha, and generated bodhicitta for the first time.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མི་སྣང་བར་གྱུར་ཏོ། །
en: The tathāgatas, too, all disappeared.

source: དེ་ནས་ཕྱག་ན་རྡོ་རྗེ་ལ་སོགས་པ་རྡོ་རྗེ་འཛིན་པ་ཐམས་ཅད་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, Vajrapāṇi and the others, all the vajra holders, Śakra, Brahmā, the protectors of the world, and the four kings spoke these words to the Blessed One:

source: དེ་བཞིན་གཤེགས་པས་བདག་ཅག་དབུགས་ཕྱུང་སྟེ།
en: “Thanks to the Tathāgata, we have respite.

source: བདག་ཅག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དང་། དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་མཚན་རྣམས་ཐོས་ཏེ།
en: We have heard the Dharma discourses and the names of the tathāgatas.

source: བཅོམ་ལྡན་འདས་ལ་ཆོས་སྨྲ་བ་དང་། འཆང་བ་དང་། འདྲི་བ་དང་། ཀློག་པ་དང་། མཆོད་པ་དང་། སྒྲོགས་པ་དེ་དག་གི་ཡུལ་ལམ། གྲོང་ཁྱེར་རམ། གཙུག་ལག་ཁང་རྣམས་བདག་ཅག་གི་ལུས་དང་སྲོག་དང་ཡང་བསྔོས་ཏེ
en: To the Blessed One, we have dedicated our countries, cities, and temples, as well as our bodies and lives, so that the Dharma will be taught, copied, recited, worshipped, and proclaimed.

source: བསྲུང་བར་བགྱི།
en: We will preserve it.

source: ཡོངས་སུ་བསྐྱབ་པར་བགྱི།
en: We will protect it.

source: དོན་ཐམས་ཅད་གྲུབ་པར་བགྱི།
en: We will accomplish all its purposes.

source: ནོར་དང་འབྲུ་རྣམས་ལེགས་པར་བསྒྲུབ་པར་བགྱི།
en: We will ensure that wealth and grains are well provided.

source: ཐམས་ཅད་དུ་མཆོད་པར་འགྱུར་བར་བགྱི།
en: We will ensure that the Blessed One will be venerated everywhere.

source: ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་བགྱི།
en: We will ensure that people are free from all diseases.

source: དྲན་པ་དང་། སྟོབས་དང་། སྤྲོ་བ་སྩལ་བར་བགྱིའོ། །
en: We will ensure that we give mindfulness, power, and inspiration.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་ལེགས་སོ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One declared, “Excellent. This is excellent!”

source: ཅི་ནས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་དམ་ཚིག་གི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མྱུར་དུ་ནུབ་པར་མི་འགྱུར་བ་དེ་ལྟར་ཁྱེད་ཀྱིས་བྱོས་ཤིག །
en: And he told them, “At all costs, make sure in this way that these teachings of the Dharma, which are the pledge of the Tathāgata, will not quickly disappear.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། ལག་ན་རྡོ་རྗེ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་དང་ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་ཐམས་ཅད་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: When the Blessed One had spoken in this way, all the bodhisattva mahāsattvas, such as Noble Avalokiteśvara, Vajrapāṇi, and others, as well as the great śrāvakas and the entire retinue, and the world of the gods, human beings, asuras, and gandharvas, rejoiced and

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: praised what the Blessed One had said.

source: འཕགས་པ་སངས་རྒྱས་ཀྱི་སྟོབས་སྐྱེད་པའི་ཆོ་འཕྲུལ་རྣམ་པར་འཕྲུལ་བ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: Here ends the noble Mahāyāna sūtra, “The Teaching on the Extraordinary Transformation that is the Miracle of Attaining the Buddha’s Powers.”
